Repository: CrossyAtom46/MediaHarbor
Catalog: Properties/Resources.*.resx
Languages: tr_tr

# doformatselectionText
source: Please Make Format Selection.
tr_tr: Lütfen Format Seçimi Yapınız.

# downloadCompleteMessage
source: Download process completed successfully.
tr_tr: İndirme işlemi başarıyla tamamlandı.

# downloadcompleteText
source: Download Complete
tr_tr: İndirme Tamamlandı

source: Download Error
tr_tr: İndirme Hatası

# downloadLocationText
source: Download Location:
tr_tr: İndirme Konumu:

source: Downloads
tr_tr: İndirilenler

# downloadText
source: Download
tr_tr: İndir

# enteratleastone
source: Please enter at least one value.
tr_tr: Lütfen en az bir değer girin

# entersongpodcasturl
source: Please enter the name of the song/podcast:
tr_tr: Lütfen şarkının/podcast'in ismini girin:

# enterTextMessage
source: Please enter the name of the song/podcast:
tr_tr: Lütfen şarkının/podcast'in ismini girin:

# enteryoutubelinkText
source: Please enter a YouTube link.
tr_tr: Lütfen bir Youtube linki girin.

# episodenumber
source: Episode Completed
tr_tr: Bölüm Tamamlandı

source: Error
tr_tr: Hata

source: File Naming
tr_tr: Dosya İsimlendirme

# filenamingText
source: File Naming
tr_tr: Dosya İsimlendirme

# folderNotFoundText
source: Download Folder Not Found.
tr_tr: İndirme Klasörü Bulunumadı.

# howManyText
source: How Many:
tr_tr: Kaç Adet:

# inputcorrectint
source: Please enter a valid number.
tr_tr: Geçerli bir sayı giriniz.

source: Movie Completed
tr_tr: .Film Tamamlandı

source: Movie Name:
tr_tr: Film Adı:

# movieseriesaudioformat
source: . Episode/Movie Audio File Link:
tr_tr: .Bölüm/Film Ses Dosyası Linki:

# movieserieskeyformat
source: . Episode/Movie Key:
tr_tr: .Bölüm/Film Key:

# movieseriesvideoformat
source: . Episode/Movie Video File Link:
tr_tr: .Bölüm/Film Video Dosyası Linki:

# movieText
source: Movie
tr_tr: Film

source: Movie Year:
tr_tr: Film Yılı:

# musicDownloadErrorText
source: Song download error
tr_tr: Şarkı indirme hatası

source: No Update
tr_tr: Güncelleme Yok

# openText
source: Open
tr_tr: Aç

# playlistText
source: Download Playlist?
tr_tr: Oynatma Listesini İndir?

# pleasecheckapp
source: Please Check the Application.
tr_tr: Lütfen Uygulamayı Kontrol Edin.

# processCompleteText
source: Process Completed
tr_tr: İşlem Tamamlandı

# richTextBox1.Text
source: MediaHarbor is a simple and user-friendly application used to download and organize media content from various platforms such as YouTube, Disney, and Spotify. 1. Select Download Location: Click the "Select Folder" button to choose the folder where downloaded media files will be saved. Media Download: 2. YouTube: Switch to the "General" tab to download YouTube videos. Paste the URL of the video or song into the "YouTube URL" field. Click the "Download" button to download the media. 3. Disney: Enter the required information to download Disney+ content. For series or movie downloads, you can enter audio, video, and key information for each episode. You can merge audio and video files to create a final media file. Spotify: 4. You can use it to download podcasts or music (Usage is available on GitHub). Enter the necessary information for the desired number of podcasts or songs. Once the download process is complete, you can find the audio files in the designated folder. Automatic Update (Optional): 5. General Tab Usage Notes: Use the "General" tab to download media content from platforms like YouTube, Vimeo, Dailymotion, Bilibili, CNN, ESPN, Flickr, Google Drive, and many others.
tr_tr: MediaHarbor, YouTube, Disney ve Spotify gibi çeşitli platformlardan medya içeriklerini indirmek ve düzenlemek için kullanılan basit ve kullanıcı dostu bir uygulamadır. 1. İndirme Konumu Seçme: "Klasör Seç" düğmesine tıklayarak indirilen medya dosyalarının kaydedileceği klasörü seçin. Medya İndirme: 2. YouTube: "Genel" sekmesine geçerek YouTube videolarını indirebilirsiniz. "YouTube URL" alanına video veya şarkının URL'sini yapıştırın. "İndir" düğmesine tıklayarak medyayı indirin. 3. Disney: Disney+ içeriklerini indirmek için gerekli bilgileri girin. Dizi veya film indirmelerinde, her bölüm için ses, video ve anahtar (key) bilgilerini girebilirsiniz. Ses ve video dosyalarını birleştirerek nihai bir medya dosyası oluşturabilirsiniz. Spotify: 4. Podcast veya müzik indirmek için kullanabilirsiniz (Kullanımı GitHub da var). İstenilen sayıda podcast veya müzik için gerekli bilgileri girin. İndirme işlemi tamamlandığında ses dosyalarını bulunan klasörde bulabilirsiniz. Otomatik Güncelleme (Opsiyonel): 5. Genel Sekmesi Kullanım Notları: "Genel" sekmesi üzerinden YouTube, Vimeo, Dailymotion, Bilibili, CNN, ESPN, Flickr, Google Drive ve birçok diğer platformlardan medya içeriklerini indirebilir.

# saveLocationText
source: Download Location
tr_tr: İndirme Konumu

# selectDownloadLocationText
source: Please Select Download Location First!
tr_tr: Lütfen İlk Önce İndirme Konumunu Seçiniz!

# selectdownloadlocfirst
source: Please Select Download Location First!
tr_tr: Lütfen İlk Önce İndirme Konumu Seçiniz!

# selectFolderText
source: Select Folder
tr_tr: Klasör Seç

source: Series Name:
tr_tr: Dizi Adı:

# seriesseason
source: Season No:
tr_tr: Sezon No:

# seriesstartep
source: Start Episode:
tr_tr: Başlangıç Bölümü:

# seriesText
source: Series
tr_tr: Dizi

# shutdownPCText
source: Shut Down Computer After Process?
tr_tr: İşlem Sonunda Bilgisayar Kapatılsın Mı?

# shuttingdownText
source: Shutting Down Computer
tr_tr: Bilgisayar Kapatılıyor

source: Song
tr_tr: şarkı

# songkey
source: Song / Podcast Key
tr_tr: Şarkı / Podcast Key

# songurl
source: Song / Podcast URL:
tr_tr: Şarkı / Podcast URL:

# startText
source: Start
tr_tr: Başlat

source: Update Completed
tr_tr: Güncelleme Tamamlandı

# updateCompletedMessage
source: Update Completed. Now you can use the application.
tr_tr: Güncelleme Tamamlandı Artık Kullanabilirsiniz.

source: Update Error
tr_tr: Güncelleme Hatası

source: Updating, Please Wait!
tr_tr: Güncelleme Yapılıyor Lütfen Bekleyiniz!

# ytdlpUpdate
source: yt-dlp.exe Update
tr_tr: yt-dlp.exe Güncellemesi
